%已知扭矩-角度的二阶微分方程，在定扭矩的情况下，求解该微分方程，再据此作出机架速度随角度变化的曲线，验证其是否大于最小起跳速度
clc
clear

%杆长初始化
l1=0.04;
l2=0.075;
l3=0.14;
%q=1;
%其余参数初始化
M=6/4;   %机器人质量，单位是kg，这里是总重/4
g=9.8;   %重力加速度
t1=0.3;  %收腿时长
tao=3;    %关节电机扭矩大小
tao=tao/1.3; %算上摩擦损失和惯性力矩,取系数1.3
%(4*tao + M*g*(l2*cos(x(1)) + (l2*sin(x(1))*(l1 - l2*cos(x(1))))/(l3^2 - (l1 - l2*cos(x(1)))^2)^(1/2)) - M*(l2*cos(x(1)) + (l2*sin(x(1))*(l1 - l2*cos(x(1))))/(l3^2 - (l1 - l2*cos(x(1)))^2)^(1/2))*((l2^2*sin(x(1))^2*diff(q(t), t)^2)/(l3^2 - (l1 - l2*cos(x(1)))^2)^(1/2) - l2*sin(x(1))*x(2)^2 + (l2*cos(x(1))*x(2)^2*(l1 - l2*cos(x(1))))/(l3^2 - (l1 - l2*cos(x(1)))^2)^(1/2) + (l2^2*sin(x(1))^2*x(2)^2*(l1 - l2*cos(x(1)))^2)/(l3^2 - (l1 - l2*cos(x(1)))^2)^(3/2)))/(M*(l2*cos(x(1)) + (l2*sin(x(1))*(l1 - l2*cos(x(1))))/(l3^2 - (l1 - l2*cos(x(1)))^2)^(1/2))^2)
%扭矩-角度的微分方程，把角加速度移到等号左边，右边是角度和角速度
odefun=@(t,x)[x(2);(4*tao + M*g*(l2*cos(x(1)) + (l2*sin(x(1))*(l1 - l2*cos(x(1))))/(l3^2 - (l1 - l2*cos(x(1)))^2)^(1/2)) - M*(l2*cos(x(1)) + (l2*sin(x(1))*(l1 - l2*cos(x(1))))/(l3^2 - (l1 - l2*cos(x(1)))^2)^(1/2))*((l2^2*sin(x(1))^2*x(2)^2)/(l3^2 - (l1 - l2*cos(x(1)))^2)^(1/2) - l2*sin(x(1))*x(2)^2 + (l2*cos(x(1))*x(2)^2*(l1 - l2*cos(x(1))))/(l3^2 - (l1 - l2*cos(x(1)))^2)^(1/2) + (l2^2*sin(x(1))^2*x(2)^2*(l1 - l2*cos(x(1)))^2)/(l3^2 - (l1 - l2*cos(x(1)))^2)^(3/2)))/(M*(l2*cos(x(1)) + (l2*sin(x(1))*(l1 - l2*cos(x(1))))/(l3^2 - (l1 - l2*cos(x(1)))^2)^(1/2))^2)];
[t,X]=ode15s(odefun,[0,1],[180*pi/180;0]); %解上述微分方程，将角度存入X的第一列，角速度存入X的第二列
angle=X(:,1);       %弧度
Angle=angle*180/pi; %转化为角度制
anglev=X(:,2);      %角速度
n=length(angle);    %数组长度
v=zeros(n,1);       %机架速度
j=0;
vmin=g*t1;          %最小起跳速度
for i=1:n
    j=j+1;
    if(Angle(j)>240)%角度不超最大限制范围
        break;
    end
    %v(j)=((sin(angle(j))*(cos(angle(j))/10 - 1/5))/(10*(49/400 - (cos(angle(j))/10 - 1/5)^2)^(1/2)) - cos(angle(j))/10)*anglev(j);%用角速度解出机架速度
    v(j)=- l2*cos(angle(j))*anglev(j) - (l2*sin(angle(j))*anglev(j)*(l1 - l2*cos(angle(j))))/(l3^2 - (l1 - l2*cos(angle(j)))^2)^(1/2);
end
plot(Angle(1:j-1),v(1:j-1))%作出角度-机架速度图像
hold on
plot([Angle(1),Angle(j-1)],[vmin,vmin])%作出最小起跳速度的横线

    